# Development Tools
cask "visual-studio-code"
cask "docker"
cask "android-studio"
cask "github"
cask "anaconda"
cask "google-chrome"

# AI/ML Tools
brew "ollama"

# Productivity Apps
cask "google-drive"
cask "whatsapp"
cask "zoom"
cask "copyclip"
cask "teamviewer"
cask "anki"

# Utilities
cask "vlc"
cask "localsend"
cask "android-file-transfer"

# Development Dependencies
brew "git"
brew "python"
brew "node"
brew "mas" # Mac App Store CLI
